# EDA


- The os module has a perfect method to list files in a directory.
- Pandas json normalize could work here but is not necessary to convert the JSON data to a dataframe.
- You may need a nested for-loop to access each sale!
- We've put a lot of time into creating the structure of this repository, and it's a good example for future projects.  In the file functions_variables.py, there is an example function that you can import and use.  If you have any variables, functions or classes that you want to make, they can be put in the functions_variables.py file and imported into a notebook.  Note that only .py files can be imported into a notebook. If you want to import everything from a .py file, you can use the following:
```python
from functions_variables import *
```
If you just import functions_variables, then each object from the file will need to be prepended with "functions_variables"\
Using this .py file will keep your notebooks very organized and make it easier to reuse code between notebooks.

In [440]:
# (this is not an exhaustive list of libraries)
import pandas as pd
import numpy as np
import os
import json
import random
import string
from pprint import pprint
from functions_variables import *

## Data Importing

#### - Testing files and paths

In [441]:
test_dir = '../data/AK_Juneau_0.json'
os.path.exists(test_dir)

True

In [442]:
# load one file first to see what type of data you're dealing with and what attributes it has
with open(test_dir) as f:
    data_json = json.load(f)

In [443]:
data_json['data'].keys()

dict_keys(['total', 'count', 'results'])

In [444]:
test_df = pd.json_normalize(data_json['data']['results'])
test_df.head(1)

,last_update_date,tags,permalink,status,list_date,open_houses,branding,list_price,property_id,photos,...,location.address.state_code,location.address.line,location.street_view_url,location.county.fips_code,location.county.name,primary_photo,source,products,location.address.coordinate,other_listings
0,2023-09-19T20:52:50Z,"[carport, community_outdoor_space, cul_de_sac,...",9453-Herbert-Pl_Juneau_AK_99801_M90744-30767,sold,2023-06-29T21:16:25.000000Z,None,"[{'name': 'EXP Realty LLC - Southeast Alaska',...",554950.0,9074430767,"[{'tags': [{'label': 'house_view', 'probabilit...",...,AK,9453 Herbert Pl,https://maps.googleapis.com/maps/api/streetvie...,None,Juneau,NaN,NaN,NaN,NaN,NaN

#### - Data Overview

In [445]:
# Getting an overview of the data before combining all the files into one dataframe. This is a custom function in `functions_variables.py` --- It takes in a directory path.
overview = json_files_summary('../data')

Error processing file .gitkeep: Expecting value: line 1 column 1 (char 0)
AK_Juneau_0.json processed. 1/251 files processed.
AK_Juneau_1.json processed. 2/251 files processed.
AK_Juneau_2.json processed. 3/251 files processed.
AK_Juneau_3.json processed. 4/251 files processed.
AK_Juneau_4.json processed. 5/251 files processed.
AL_Montgomery_0.json processed. 6/251 files processed.
AL_Montgomery_1.json processed. 7/251 files processed.
AL_Montgomery_2.json processed. 8/251 files processed.
AL_Montgomery_3.json processed. 9/251 files processed.
AL_Montgomery_4.json processed. 10/251 files processed.
AR_LittleRock_0.json processed. 11/251 files processed.
AR_LittleRock_1.json processed. 12/251 files processed.
AR_LittleRock_2.json processed. 13/251 files processed.
AR_LittleRock_3.json processed. 14/251 files processed.
AR_LittleRock_4.json processed. 15/251 files processed.
AZ_Phoenix_0.json processed. 16/251 files processed.
AZ_Phoenix_1.json processed. 17/251 files processed.
AZ_Phoenix_2.json processed. 18/251 files processed.
AZ_Phoenix_3.json processed. 19/251 files processed.
AZ_Phoenix_4.json processed. 20/251 files processed.
CA_Sacramento_0.json processed. 21/251 files processed.
CA_Sacramento_1.json processed. 22/251 files processed.
CA_Sacramento_2.json processed. 23/251 files processed.
CA_Sacramento_3.json processed. 24/251 files processed.
CA_Sacramento_4.json processed. 25/251 files processed.
CO_Denver_0.json processed. 26/251 files processed.
CO_Denver_1.json processed. 27/251 files processed.
CO_Denver_2.json processed. 28/251 files processed.
CO_Denver_3.json processed. 29/251 files processed.
CO_Denver_4.json processed. 30/251 files processed.
CT_Hartford_0.json processed. 31/251 files processed.
CT_Hartford_1.json processed. 32/251 files processed.
CT_Hartford_2.json processed. 33/251 files processed.
CT_Hartford_3.json processed. 34/251 files processed.
CT_Hartford_4.json processed. 35/251 files processed.
DE_Dover_0.json processed. 36/251 files processed.
DE_Dover_1.json processed. 37/251 files processed.
DE_Dover_2.json processed. 38/251 files processed.
DE_Dover_3.json processed. 39/251 files processed.
DE_Dover_4.json processed. 40/251 files processed.
FL_Tallahassee_0.json processed. 41/251 files processed.
FL_Tallahassee_1.json processed. 42/251 files processed.
FL_Tallahassee_2.json processed. 43/251 files processed.
FL_Tallahassee_3.json processed. 44/251 files processed.
FL_Tallahassee_4.json processed. 45/251 files processed.
GA_Atlanta_0.json processed. 46/251 files processed.
GA_Atlanta_1.json processed. 47/251 files processed.
GA_Atlanta_2.json processed. 48/251 files processed.
GA_Atlanta_3.json processed. 49/251 files processed.
GA_Atlanta_4.json processed. 50/251 files processed.
HI_Honolulu_0.json processed. 51/251 files processed.
HI_Honolulu_1.json processed. 52/251 files processed.
HI_Honolulu_2.json processed. 53/251 files processed.
HI_Honolulu_3.json processed. 54/251 files processed.
HI_Honolulu_4.json processed. 55/251 files processed.
IA_DesMoines_0.json processed. 56/251 files processed.
IA_DesMoines_1.json processed. 57/251 files processed.
IA_DesMoines_2.json processed. 58/251 files processed.
IA_DesMoines_3.json processed. 59/251 files processed.
IA_DesMoines_4.json processed. 60/251 files processed.
ID_Boise_0.json processed. 61/251 files processed.
ID_Boise_1.json processed. 62/251 files processed.
ID_Boise_2.json processed. 63/251 files processed.
ID_Boise_3.json processed. 64/251 files processed.
ID_Boise_4.json processed. 65/251 files processed.
IL_Springfield_0.json processed. 66/251 files processed.
IL_Springfield_1.json processed. 67/251 files processed.
IL_Springfield_2.json processed. 68/251 files processed.
IL_Springfield_3.json processed. 69/251 files processed.
IL_Springfield_4.json processed. 70/251 files processed.
IN_Indianapolis_0.json processed. 71/251 files processed.
IN_Indianapolis_1.json processed. 72/251 files processed.
IN_Indianapolis_2.json processed. 73/251 files processed.
IN_Indianapolis_3.json processed. 74/251 files processed.
IN_Indianapolis_4.json processed. 75/251 files processed.
KS_Topeka_0.json processed. 76/251 files processed.
KS_Topeka_1.json processed. 77/251 files processed.
KS_Topeka_2.json processed. 78/251 files processed.
KS_Topeka_3.json processed. 79/251 files processed.
KS_Topeka_4.json processed. 80/251 files processed.
KY_Frankfort_0.json processed. 81/251 files processed.
KY_Frankfort_1.json processed. 82/251 files processed.
KY_Frankfort_2.json processed. 83/251 files processed.
KY_Frankfort_3.json processed. 84/251 files processed.
KY_Frankfort_4.json processed. 85/251 files processed.
LA_BatonRouge_0.json processed. 86/251 files processed.
LA_BatonRouge_1.json processed. 87/251 files processed.
LA_BatonRouge_2.json processed. 88/251 files processed.
LA_BatonRouge_3.json processed. 89/251 files processed.
LA_BatonRouge_4.json processed. 90/251 files processed.
MA_Boston_0.json processed. 91/251 files processed.
MA_Boston_1.json processed. 92/251 files processed.
MA_Boston_2.json processed. 93/251 files processed.
MA_Boston_3.json processed. 94/251 files processed.
MA_Boston_4.json processed. 95/251 files processed.
MD_Annapolis_0.json processed. 96/251 files processed.
MD_Annapolis_1.json processed. 97/251 files processed.
MD_Annapolis_2.json processed. 98/251 files processed.
MD_Annapolis_3.json processed. 99/251 files processed.
MD_Annapolis_4.json processed. 100/251 files processed.
ME_Augusta_0.json processed. 101/251 files processed.
ME_Augusta_1.json processed. 102/251 files processed.
ME_Augusta_2.json processed. 103/251 files processed.
ME_Augusta_3.json processed. 104/251 files processed.
ME_Augusta_4.json processed. 105/251 files processed.
MI_Lansing_0.json processed. 106/251 files processed.
MI_Lansing_1.json processed. 107/251 files processed.
MI_Lansing_2.json processed. 108/251 files processed.
MI_Lansing_3.json processed. 109/251 files processed.
MI_Lansing_4.json processed. 110/251 files processed.
MN_St.Paul_0.json processed. 111/251 files processed.
MN_St.Paul_1.json processed. 112/251 files processed.
MN_St.Paul_2.json processed. 113/251 files processed.
MN_St.Paul_3.json processed. 114/251 files processed.
MN_St.Paul_4.json processed. 115/251 files processed.
MO_JeffersonCity_0.json processed. 116/251 files processed.
MO_JeffersonCity_1.json processed. 117/251 files processed.
MO_JeffersonCity_2.json processed. 118/251 files processed.
MO_JeffersonCity_3.json processed. 119/251 files processed.
MO_JeffersonCity_4.json processed. 120/251 files processed.
MS_Jackson_0.json processed. 121/251 files processed.
MS_Jackson_1.json processed. 122/251 files processed.
MS_Jackson_2.json processed. 123/251 files processed.
MS_Jackson_3.json processed. 124/251 files processed.
MS_Jackson_4.json processed. 125/251 files processed.
MT_Helena_0.json processed. 126/251 files processed.
MT_Helena_1.json processed. 127/251 files processed.
MT_Helena_2.json processed. 128/251 files processed.
MT_Helena_3.json processed. 129/251 files processed.
MT_Helena_4.json processed. 130/251 files processed.
NC_Raleigh_0.json processed. 131/251 files processed.
NC_Raleigh_1.json processed. 132/251 files processed.
NC_Raleigh_2.json processed. 133/251 files processed.
NC_Raleigh_3.json processed. 134/251 files processed.
NC_Raleigh_4.json processed. 135/251 files processed.
ND_Bismarck_0.json processed. 136/251 files processed.
ND_Bismarck_1.json processed. 137/251 files processed.
ND_Bismarck_2.json processed. 138/251 files processed.
ND_Bismarck_3.json processed. 139/251 files processed.
ND_Bismarck_4.json processed. 140/251 files processed.
NE_Lincoln_0.json processed. 141/251 files processed.
NE_Lincoln_1.json processed. 142/251 files processed.
NE_Lincoln_2.json processed. 143/251 files processed.
NE_Lincoln_3.json processed. 144/251 files processed.
NE_Lincoln_4.json processed. 145/251 files processed.
NH_Concord_0.json processed. 146/251 files processed.
NH_Concord_1.json processed. 147/251 files processed.
NH_Concord_2.json processed. 148/251 files processed.
NH_Concord_3.json processed. 149/251 files processed.
NH_Concord_4.json processed. 150/251 files processed.
NJ_Trenton_0.json processed. 151/251 files processed.
NJ_Trenton_1.json processed. 152/251 files processed.
NJ_Trenton_2.json processed. 153/251 files processed.
NJ_Trenton_3.json processed. 154/251 files processed.
NJ_Trenton_4.json processed. 155/251 files processed.
NM_SantaFe_0.json processed. 156/251 files processed.
NM_SantaFe_1.json processed. 157/251 files processed.
NM_SantaFe_2.json processed. 158/251 files processed.
NM_SantaFe_3.json processed. 159/251 files processed.
NM_SantaFe_4.json processed. 160/251 files processed.
NV_CarsonCity_0.json processed. 161/251 files processed.
NV_CarsonCity_1.json processed. 162/251 files processed.
NV_CarsonCity_2.json processed. 163/251 files processed.
NV_CarsonCity_3.json processed. 164/251 files processed.
NV_CarsonCity_4.json processed. 165/251 files processed.
NY_Albany_0.json processed. 166/251 files processed.
NY_Albany_1.json processed. 167/251 files processed.
NY_Albany_2.json processed. 168/251 files processed.
NY_Albany_3.json processed. 169/251 files processed.
NY_Albany_4.json processed. 170/251 files processed.
OH_Columbus_0.json processed. 171/251 files processed.
OH_Columbus_1.json processed. 172/251 files processed.
OH_Columbus_2.json processed. 173/251 files processed.
OH_Columbus_3.json processed. 174/251 files processed.
OH_Columbus_4.json processed. 175/251 files processed.
OK_OklahomaCity_0.json processed. 176/251 files processed.
OK_OklahomaCity_1.json processed. 177/251 files processed.
OK_OklahomaCity_2.json processed. 178/251 files processed.
OK_OklahomaCity_3.json processed. 179/251 files processed.
OK_OklahomaCity_4.json processed. 180/251 files processed.
OR_Salem_0.json processed. 181/251 files processed.
OR_Salem_1.json processed. 182/251 files processed.
OR_Salem_2.json processed. 183/251 files processed.
OR_Salem_3.json processed. 184/251 files processed.
OR_Salem_4.json processed. 185/251 files processed.
PA_Harrisburg_0.json processed. 186/251 files processed.
PA_Harrisburg_1.json processed. 187/251 files processed.
PA_Harrisburg_2.json processed. 188/251 files processed.
PA_Harrisburg_3.json processed. 189/251 files processed.
PA_Harrisburg_4.json processed. 190/251 files processed.
RI_Providence_0.json processed. 191/251 files processed.
RI_Providence_1.json processed. 192/251 files processed.
RI_Providence_2.json processed. 193/251 files processed.
RI_Providence_3.json processed. 194/251 files processed.
RI_Providence_4.json processed. 195/251 files processed.
SC_Columbia_0.json processed. 196/251 files processed.
SC_Columbia_1.json processed. 197/251 files processed.
SC_Columbia_2.json processed. 198/251 files processed.
SC_Columbia_3.json processed. 199/251 files processed.
SC_Columbia_4.json processed. 200/251 files processed.
SD_Pierre_0.json processed. 201/251 files processed.
SD_Pierre_1.json processed. 202/251 files processed.
SD_Pierre_2.json processed. 203/251 files processed.
SD_Pierre_3.json processed. 204/251 files processed.
SD_Pierre_4.json processed. 205/251 files processed.
TN_Nashville_0.json processed. 206/251 files processed.
TN_Nashville_1.json processed. 207/251 files processed.
TN_Nashville_2.json processed. 208/251 files processed.
TN_Nashville_3.json processed. 209/251 files processed.
TN_Nashville_4.json processed. 210/251 files processed.
TX_Austin_0.json processed. 211/251 files processed.
TX_Austin_1.json processed. 212/251 files processed.
TX_Austin_2.json processed. 213/251 files processed.
TX_Austin_3.json processed. 214/251 files processed.
TX_Austin_4.json processed. 215/251 files processed.
UT_SaltLakeCity_0.json processed. 216/251 files processed.
UT_SaltLakeCity_1.json processed. 217/251 files processed.
UT_SaltLakeCity_2.json processed. 218/251 files processed.
UT_SaltLakeCity_3.json processed. 219/251 files processed.
UT_SaltLakeCity_4.json processed. 220/251 files processed.
VA_Richmond_0.json processed. 221/251 files processed.
VA_Richmond_1.json processed. 222/251 files processed.
VA_Richmond_2.json processed. 223/251 files processed.
VA_Richmond_3.json processed. 224/251 files processed.
VA_Richmond_4.json processed. 225/251 files processed.
VT_Montpelier_0.json processed. 226/251 files processed.
VT_Montpelier_1.json processed. 227/251 files processed.
VT_Montpelier_2.json processed. 228/251 files processed.
VT_Montpelier_3.json processed. 229/251 files processed.
VT_Montpelier_4.json processed. 230/251 files processed.
WA_Olympia_0.json processed. 231/251 files processed.
WA_Olympia_1.json processed. 232/251 files processed.
WA_Olympia_2.json processed. 233/251 files processed.
WA_Olympia_3.json processed. 234/251 files processed.
WA_Olympia_4.json processed. 235/251 files processed.
WI_Madison_0.json processed. 236/251 files processed.
WI_Madison_1.json processed. 237/251 files processed.
WI_Madison_2.json processed. 238/251 files processed.
WI_Madison_3.json processed. 239/251 files processed.
WI_Madison_4.json processed. 240/251 files processed.
WV_Charleston_0.json processed. 241/251 files processed.
WV_Charleston_1.json processed. 242/251 files processed.
WV_Charleston_2.json processed. 243/251 files processed.
WV_Charleston_3.json processed. 244/251 files processed.
WV_Charleston_4.json processed. 245/251 files processed.
WY_Cheyenne_0.json processed. 246/251 files processed.
WY_Cheyenne_1.json processed. 247/251 files processed.
WY_Cheyenne_2.json processed. 248/251 files processed.
WY_Cheyenne_3.json processed. 249/251 files processed.
WY_Cheyenne_4.json processed. 250/251 files processed.

Process complete.

In [446]:
overview
# After reviewing the data with Data Wrangler, I found that some files may be missing the 'results' key, or it is empty.

,file_name,file_path,rows_count,cols_count,cols_name
0,AK_Juneau_0.json,../data\AK_Juneau_0.json,8,64,"[last_update_date, tags, permalink, status, li..."
1,AK_Juneau_1.json,../data\AK_Juneau_1.json,7,63,"[primary_photo, last_update_date, source, tags..."
2,AK_Juneau_2.json,../data\AK_Juneau_2.json,6,63,"[primary_photo, last_update_date, source, tags..."
3,AK_Juneau_3.json,../data\AK_Juneau_3.json,5,63,"[primary_photo, last_update_date, source, tags..."
4,AK_Juneau_4.json,../data\AK_Juneau_4.json,4,63,"[primary_photo, last_update_date, source, tags..."
...,...,...,...,...,...
245,WY_Cheyenne_0.json,../data\WY_Cheyenne_0.json,1,0,[]
246,WY_Cheyenne_1.json,../data\WY_Cheyenne_1.json,1,0,[]
247,WY_Cheyenne_2.json,../data\WY_Cheyenne_2.json,1,0,[]
248,WY_Cheyenne_3.json,../data\WY_Cheyenne_3.json,1,0,[]
249,WY_Cheyenne_4.json,../data\WY_Cheyenne_4.json,1,0,[]

In [447]:
overview.shape

(250, 5)

In [448]:
overview

,file_name,file_path,rows_count,cols_count,cols_name
0,AK_Juneau_0.json,../data\AK_Juneau_0.json,8,64,"[last_update_date, tags, permalink, status, li..."
1,AK_Juneau_1.json,../data\AK_Juneau_1.json,7,63,"[primary_photo, last_update_date, source, tags..."
2,AK_Juneau_2.json,../data\AK_Juneau_2.json,6,63,"[primary_photo, last_update_date, source, tags..."
3,AK_Juneau_3.json,../data\AK_Juneau_3.json,5,63,"[primary_photo, last_update_date, source, tags..."
4,AK_Juneau_4.json,../data\AK_Juneau_4.json,4,63,"[primary_photo, last_update_date, source, tags..."
...,...,...,...,...,...
245,WY_Cheyenne_0.json,../data\WY_Cheyenne_0.json,1,0,[]
246,WY_Cheyenne_1.json,../data\WY_Cheyenne_1.json,1,0,[]
247,WY_Cheyenne_2.json,../data\WY_Cheyenne_2.json,1,0,[]
248,WY_Cheyenne_3.json,../data\WY_Cheyenne_3.json,1,0,[]
249,WY_Cheyenne_4.json,../data\WY_Cheyenne_4.json,1,0,[]

##### - Comparing, Checking files

In [449]:
# 226 -- just chose one of the files that has an empty 'results' key
weird_file_path = overview.iloc[226]['file_path']

with open(weird_file_path) as f:
  weird_file = json.load(f)

weird_file['data'].keys()

dict_keys(['total', 'count', 'results'])

In [450]:
len(weird_file['data']['results']), len(data_json['data']['results']) # Weird vs Normal File

(0, 8)

In [451]:
weird_files = overview[overview['cols_count'] == 0]

weird_files.shape

(32, 5)

In [452]:
# Create a list of files with an empty 'results' key or has other problems
weird = []
extra_weird = []
  
for file in weird_files['file_path']:
  
  with open(file) as f:
    weird_file = json.load(f)
  
  if len(weird_file['data']['results']) == 0:
    print(f'{file} returns empty \'results\'')
    weird.append(file)
  
  else:
    print(f'{file} has another problem...')
    extra_weird.append(file)

../data\HI_Honolulu_3.json returns empty 'results'
../data\HI_Honolulu_4.json returns empty 'results'
../data\ME_Augusta_0.json returns empty 'results'
../data\ME_Augusta_1.json returns empty 'results'
../data\ME_Augusta_2.json returns empty 'results'
../data\ME_Augusta_3.json returns empty 'results'
../data\ME_Augusta_4.json returns empty 'results'
../data\MS_Jackson_0.json returns empty 'results'
../data\MS_Jackson_1.json returns empty 'results'
../data\MS_Jackson_2.json returns empty 'results'
../data\MS_Jackson_3.json returns empty 'results'
../data\MS_Jackson_4.json returns empty 'results'
../data\ND_Bismarck_2.json returns empty 'results'
../data\ND_Bismarck_3.json returns empty 'results'
../data\ND_Bismarck_4.json returns empty 'results'
../data\NH_Concord_3.json returns empty 'results'
../data\NH_Concord_4.json returns empty 'results'
../data\SD_Pierre_0.json returns empty 'results'
../data\SD_Pierre_1.json returns empty 'results'
../data\SD_Pierre_2.json returns empty 'results'
../data\SD_Pierre_3.json returns empty 'results'
../data\SD_Pierre_4.json returns empty 'results'
../data\VT_Montpelier_0.json returns empty 'results'
../data\VT_Montpelier_1.json returns empty 'results'
../data\VT_Montpelier_2.json returns empty 'results'
../data\VT_Montpelier_3.json returns empty 'results'
../data\VT_Montpelier_4.json returns empty 'results'
../data\WY_Cheyenne_0.json returns empty 'results'
../data\WY_Cheyenne_1.json returns empty 'results'
../data\WY_Cheyenne_2.json returns empty 'results'
../data\WY_Cheyenne_3.json returns empty 'results'
../data\WY_Cheyenne_4.json returns empty 'results'

In [453]:
print(f'\n{len(weird)} Weird Files...\n{weird}')
print(f'\n{len(extra_weird)} Extra Weird Files... \n{extra_weird}')

32 Weird Files...
['../data\\HI_Honolulu_3.json', '../data\\HI_Honolulu_4.json', '../data\\ME_Augusta_0.json', '../data\\ME_Augusta_1.json', '../data\\ME_Augusta_2.json', '../data\\ME_Augusta_3.json', '../data\\ME_Augusta_4.json', '../data\\MS_Jackson_0.json', '../data\\MS_Jackson_1.json', '../data\\MS_Jackson_2.json', '../data\\MS_Jackson_3.json', '../data\\MS_Jackson_4.json', '../data\\ND_Bismarck_2.json', '../data\\ND_Bismarck_3.json', '../data\\ND_Bismarck_4.json', '../data\\NH_Concord_3.json', '../data\\NH_Concord_4.json', '../data\\SD_Pierre_0.json', '../data\\SD_Pierre_1.json', '../data\\SD_Pierre_2.json', '../data\\SD_Pierre_3.json', '../data\\SD_Pierre_4.json', '../data\\VT_Montpelier_0.json', '../data\\VT_Montpelier_1.json', '../data\\VT_Montpelier_2.json', '../data\\VT_Montpelier_3.json', '../data\\VT_Montpelier_4.json', '../data\\WY_Cheyenne_0.json', '../data\\WY_Cheyenne_1.json', '../data\\WY_Cheyenne_2.json', '../data\\WY_Cheyenne_3.json', '../data\\WY_Cheyenne_4.json']

0 Extra Weird Files...
[]

In [454]:
# Safe to drop the weird files from the overview dataframe
drop = [i for i in weird_files.index]

overview.drop(drop, inplace=True) # Originally 250, 5

In [455]:
overview.shape

(218, 5)

In [456]:
overview # I will use the file_path column to load the data

,file_name,file_path,rows_count,cols_count,cols_name
0,AK_Juneau_0.json,../data\AK_Juneau_0.json,8,64,"[last_update_date, tags, permalink, status, li..."
1,AK_Juneau_1.json,../data\AK_Juneau_1.json,7,63,"[primary_photo, last_update_date, source, tags..."
2,AK_Juneau_2.json,../data\AK_Juneau_2.json,6,63,"[primary_photo, last_update_date, source, tags..."
3,AK_Juneau_3.json,../data\AK_Juneau_3.json,5,63,"[primary_photo, last_update_date, source, tags..."
4,AK_Juneau_4.json,../data\AK_Juneau_4.json,4,63,"[primary_photo, last_update_date, source, tags..."
...,...,...,...,...,...
240,WV_Charleston_0.json,../data\WV_Charleston_0.json,42,61,"[last_update_date, tags, permalink, status, li..."
241,WV_Charleston_1.json,../data\WV_Charleston_1.json,42,61,"[last_update_date, tags, permalink, status, li..."
242,WV_Charleston_2.json,../data\WV_Charleston_2.json,41,61,"[last_update_date, tags, permalink, status, li..."
243,WV_Charleston_3.json,../data\WV_Charleston_3.json,40,61,"[last_update_date, tags, permalink, status, li..."
244,WV_Charleston_4.json,../data\WV_Charleston_4.json,39,61,"[last_update_date, tags, permalink, status, li..."

##### - Resuming Data Import Procedures

In [457]:
# Testing the custom function `read_json` which takes a file path and returns a DataFrame
read_json(test_dir).head(2) # Works!

,last_update_date,tags,permalink,status,list_date,open_houses,branding,list_price,property_id,photos,...,location.address.state_code,location.address.line,location.street_view_url,location.county.fips_code,location.county.name,primary_photo,source,products,location.address.coordinate,other_listings
0,2023-09-19T20:52:50Z,"[carport, community_outdoor_space, cul_de_sac,...",9453-Herbert-Pl_Juneau_AK_99801_M90744-30767,sold,2023-06-29T21:16:25.000000Z,None,"[{'name': 'EXP Realty LLC - Southeast Alaska',...",554950.0,9074430767,"[{'tags': [{'label': 'house_view', 'probabilit...",...,AK,9453 Herbert Pl,https://maps.googleapis.com/maps/api/streetvie...,None,Juneau,NaN,NaN,NaN,NaN,NaN
1,None,None,8477-Thunder-Mountain-Rd_Juneau_AK_99801_M9424...,sold,None,None,"[{'name': None, 'photo': None, 'type': 'Office'}]",NaN,9424983842,None,...,AK,8477 Thunder Mountain Rd,https://maps.googleapis.com/maps/api/streetvie...,None,Juneau,NaN,NaN,NaN,NaN,NaN

In [458]:
# loop over all files and put them into a dataframe
combine_all = []

for path in overview['file_path']:
  df = read_json(path)
  combine_all.append(df)
  print(f'{path} added to the list. {len(combine_all)}/{overview.shape[0]} processed...')

print(f'\n{len(combine_all)} files loaded into the list of DataFrames.')

../data\AK_Juneau_0.json added to the list. 1/218 processed...
../data\AK_Juneau_1.json added to the list. 2/218 processed...
../data\AK_Juneau_2.json added to the list. 3/218 processed...
../data\AK_Juneau_3.json added to the list. 4/218 processed...
../data\AK_Juneau_4.json added to the list. 5/218 processed...
../data\AL_Montgomery_0.json added to the list. 6/218 processed...
../data\AL_Montgomery_1.json added to the list. 7/218 processed...
../data\AL_Montgomery_2.json added to the list. 8/218 processed...
../data\AL_Montgomery_3.json added to the list. 9/218 processed...
../data\AL_Montgomery_4.json added to the list. 10/218 processed...
../data\AR_LittleRock_0.json added to the list. 11/218 processed...
../data\AR_LittleRock_1.json added to the list. 12/218 processed...
../data\AR_LittleRock_2.json added to the list. 13/218 processed...
../data\AR_LittleRock_3.json added to the list. 14/218 processed...
../data\AR_LittleRock_4.json added to the list. 15/218 processed...
../data\AZ_Phoenix_0.json added to the list. 16/218 processed...
../data\AZ_Phoenix_1.json added to the list. 17/218 processed...
../data\AZ_Phoenix_2.json added to the list. 18/218 processed...
../data\AZ_Phoenix_3.json added to the list. 19/218 processed...
../data\AZ_Phoenix_4.json added to the list. 20/218 processed...
../data\CA_Sacramento_0.json added to the list. 21/218 processed...
../data\CA_Sacramento_1.json added to the list. 22/218 processed...
../data\CA_Sacramento_2.json added to the list. 23/218 processed...
../data\CA_Sacramento_3.json added to the list. 24/218 processed...
../data\CA_Sacramento_4.json added to the list. 25/218 processed...
../data\CO_Denver_0.json added to the list. 26/218 processed...
../data\CO_Denver_1.json added to the list. 27/218 processed...
../data\CO_Denver_2.json added to the list. 28/218 processed...
../data\CO_Denver_3.json added to the list. 29/218 processed...
../data\CO_Denver_4.json added to the list. 30/218 processed...
../data\CT_Hartford_0.json added to the list. 31/218 processed...
../data\CT_Hartford_1.json added to the list. 32/218 processed...
../data\CT_Hartford_2.json added to the list. 33/218 processed...
../data\CT_Hartford_3.json added to the list. 34/218 processed...
../data\CT_Hartford_4.json added to the list. 35/218 processed...
../data\DE_Dover_0.json added to the list. 36/218 processed...
../data\DE_Dover_1.json added to the list. 37/218 processed...
../data\DE_Dover_2.json added to the list. 38/218 processed...
../data\DE_Dover_3.json added to the list. 39/218 processed...
../data\DE_Dover_4.json added to the list. 40/218 processed...
../data\FL_Tallahassee_0.json added to the list. 41/218 processed...
../data\FL_Tallahassee_1.json added to the list. 42/218 processed...
../data\FL_Tallahassee_2.json added to the list. 43/218 processed...
../data\FL_Tallahassee_3.json added to the list. 44/218 processed...
../data\FL_Tallahassee_4.json added to the list. 45/218 processed...
../data\GA_Atlanta_0.json added to the list. 46/218 processed...
../data\GA_Atlanta_1.json added to the list. 47/218 processed...
../data\GA_Atlanta_2.json added to the list. 48/218 processed...
../data\GA_Atlanta_3.json added to the list. 49/218 processed...
../data\GA_Atlanta_4.json added to the list. 50/218 processed...
../data\HI_Honolulu_0.json added to the list. 51/218 processed...
../data\HI_Honolulu_1.json added to the list. 52/218 processed...
../data\HI_Honolulu_2.json added to the list. 53/218 processed...
../data\IA_DesMoines_0.json added to the list. 54/218 processed...
../data\IA_DesMoines_1.json added to the list. 55/218 processed...
../data\IA_DesMoines_2.json added to the list. 56/218 processed...
../data\IA_DesMoines_3.json added to the list. 57/218 processed...
../data\IA_DesMoines_4.json added to the list. 58/218 processed...
../data\ID_Boise_0.json added to the list. 59/218 processed...
../data\ID_Boise_1.json added to the list. 60/218 processed...
../data\ID_Boise_2.json added to the list. 61/218 processed...
../data\ID_Boise_3.json added to the list. 62/218 processed...
../data\ID_Boise_4.json added to the list. 63/218 processed...
../data\IL_Springfield_0.json added to the list. 64/218 processed...
../data\IL_Springfield_1.json added to the list. 65/218 processed...
../data\IL_Springfield_2.json added to the list. 66/218 processed...
../data\IL_Springfield_3.json added to the list. 67/218 processed...
../data\IL_Springfield_4.json added to the list. 68/218 processed...
../data\IN_Indianapolis_0.json added to the list. 69/218 processed...
../data\IN_Indianapolis_1.json added to the list. 70/218 processed...
../data\IN_Indianapolis_2.json added to the list. 71/218 processed...
../data\IN_Indianapolis_3.json added to the list. 72/218 processed...
../data\IN_Indianapolis_4.json added to the list. 73/218 processed...
../data\KS_Topeka_0.json added to the list. 74/218 processed...
../data\KS_Topeka_1.json added to the list. 75/218 processed...
../data\KS_Topeka_2.json added to the list. 76/218 processed...
../data\KS_Topeka_3.json added to the list. 77/218 processed...
../data\KS_Topeka_4.json added to the list. 78/218 processed...
../data\KY_Frankfort_0.json added to the list. 79/218 processed...
../data\KY_Frankfort_1.json added to the list. 80/218 processed...
../data\KY_Frankfort_2.json added to the list. 81/218 processed...
../data\KY_Frankfort_3.json added to the list. 82/218 processed...
../data\KY_Frankfort_4.json added to the list. 83/218 processed...
../data\LA_BatonRouge_0.json added to the list. 84/218 processed...
../data\LA_BatonRouge_1.json added to the list. 85/218 processed...
../data\LA_BatonRouge_2.json added to the list. 86/218 processed...
../data\LA_BatonRouge_3.json added to the list. 87/218 processed...
../data\LA_BatonRouge_4.json added to the list. 88/218 processed...
../data\MA_Boston_0.json added to the list. 89/218 processed...
../data\MA_Boston_1.json added to the list. 90/218 processed...
../data\MA_Boston_2.json added to the list. 91/218 processed...
../data\MA_Boston_3.json added to the list. 92/218 processed...
../data\MA_Boston_4.json added to the list. 93/218 processed...
../data\MD_Annapolis_0.json added to the list. 94/218 processed...
../data\MD_Annapolis_1.json added to the list. 95/218 processed...
../data\MD_Annapolis_2.json added to the list. 96/218 processed...
../data\MD_Annapolis_3.json added to the list. 97/218 processed...
../data\MD_Annapolis_4.json added to the list. 98/218 processed...
../data\MI_Lansing_0.json added to the list. 99/218 processed...
../data\MI_Lansing_1.json added to the list. 100/218 processed...
../data\MI_Lansing_2.json added to the list. 101/218 processed...
../data\MI_Lansing_3.json added to the list. 102/218 processed...
../data\MI_Lansing_4.json added to the list. 103/218 processed...
../data\MN_St.Paul_0.json added to the list. 104/218 processed...
../data\MN_St.Paul_1.json added to the list. 105/218 processed...
../data\MN_St.Paul_2.json added to the list. 106/218 processed...
../data\MN_St.Paul_3.json added to the list. 107/218 processed...
../data\MN_St.Paul_4.json added to the list. 108/218 processed...
../data\MO_JeffersonCity_0.json added to the list. 109/218 processed...
../data\MO_JeffersonCity_1.json added to the list. 110/218 processed...
../data\MO_JeffersonCity_2.json added to the list. 111/218 processed...
../data\MO_JeffersonCity_3.json added to the list. 112/218 processed...
../data\MO_JeffersonCity_4.json added to the list. 113/218 processed...
../data\MT_Helena_0.json added to the list. 114/218 processed...
../data\MT_Helena_1.json added to the list. 115/218 processed...
../data\MT_Helena_2.json added to the list. 116/218 processed...
../data\MT_Helena_3.json added to the list. 117/218 processed...
../data\MT_Helena_4.json added to the list. 118/218 processed...
../data\NC_Raleigh_0.json added to the list. 119/218 processed...
../data\NC_Raleigh_1.json added to the list. 120/218 processed...
../data\NC_Raleigh_2.json added to the list. 121/218 processed...
../data\NC_Raleigh_3.json added to the list. 122/218 processed...
../data\NC_Raleigh_4.json added to the list. 123/218 processed...
../data\ND_Bismarck_0.json added to the list. 124/218 processed...
../data\ND_Bismarck_1.json added to the list. 125/218 processed...
../data\NE_Lincoln_0.json added to the list. 126/218 processed...
../data\NE_Lincoln_1.json added to the list. 127/218 processed...
../data\NE_Lincoln_2.json added to the list. 128/218 processed...
../data\NE_Lincoln_3.json added to the list. 129/218 processed...
../data\NE_Lincoln_4.json added to the list. 130/218 processed...
../data\NH_Concord_0.json added to the list. 131/218 processed...
../data\NH_Concord_1.json added to the list. 132/218 processed...
../data\NH_Concord_2.json added to the list. 133/218 processed...
../data\NJ_Trenton_0.json added to the list. 134/218 processed...
../data\NJ_Trenton_1.json added to the list. 135/218 processed...
../data\NJ_Trenton_2.json added to the list. 136/218 processed...
../data\NJ_Trenton_3.json added to the list. 137/218 processed...
../data\NJ_Trenton_4.json added to the list. 138/218 processed...
../data\NM_SantaFe_0.json added to the list. 139/218 processed...
../data\NM_SantaFe_1.json added to the list. 140/218 processed...
../data\NM_SantaFe_2.json added to the list. 141/218 processed...
../data\NM_SantaFe_3.json added to the list. 142/218 processed...
../data\NM_SantaFe_4.json added to the list. 143/218 processed...
../data\NV_CarsonCity_0.json added to the list. 144/218 processed...
../data\NV_CarsonCity_1.json added to the list. 145/218 processed...
../data\NV_CarsonCity_2.json added to the list. 146/218 processed...
../data\NV_CarsonCity_3.json added to the list. 147/218 processed...
../data\NV_CarsonCity_4.json added to the list. 148/218 processed...
../data\NY_Albany_0.json added to the list. 149/218 processed...
../data\NY_Albany_1.json added to the list. 150/218 processed...
../data\NY_Albany_2.json added to the list. 151/218 processed...
../data\NY_Albany_3.json added to the list. 152/218 processed...
../data\NY_Albany_4.json added to the list. 153/218 processed...
../data\OH_Columbus_0.json added to the list. 154/218 processed...
../data\OH_Columbus_1.json added to the list. 155/218 processed...
../data\OH_Columbus_2.json added to the list. 156/218 processed...
../data\OH_Columbus_3.json added to the list. 157/218 processed...
../data\OH_Columbus_4.json added to the list. 158/218 processed...
../data\OK_OklahomaCity_0.json added to the list. 159/218 processed...
../data\OK_OklahomaCity_1.json added to the list. 160/218 processed...
../data\OK_OklahomaCity_2.json added to the list. 161/218 processed...
../data\OK_OklahomaCity_3.json added to the list. 162/218 processed...
../data\OK_OklahomaCity_4.json added to the list. 163/218 processed...
../data\OR_Salem_0.json added to the list. 164/218 processed...
../data\OR_Salem_1.json added to the list. 165/218 processed...
../data\OR_Salem_2.json added to the list. 166/218 processed...
../data\OR_Salem_3.json added to the list. 167/218 processed...
../data\OR_Salem_4.json added to the list. 168/218 processed...
../data\PA_Harrisburg_0.json added to the list. 169/218 processed...
../data\PA_Harrisburg_1.json added to the list. 170/218 processed...
../data\PA_Harrisburg_2.json added to the list. 171/218 processed...
../data\PA_Harrisburg_3.json added to the list. 172/218 processed...
../data\PA_Harrisburg_4.json added to the list. 173/218 processed...
../data\RI_Providence_0.json added to the list. 174/218 processed...
../data\RI_Providence_1.json added to the list. 175/218 processed...
../data\RI_Providence_2.json added to the list. 176/218 processed...
../data\RI_Providence_3.json added to the list. 177/218 processed...
../data\RI_Providence_4.json added to the list. 178/218 processed...
../data\SC_Columbia_0.json added to the list. 179/218 processed...
../data\SC_Columbia_1.json added to the list. 180/218 processed...
../data\SC_Columbia_2.json added to the list. 181/218 processed...
../data\SC_Columbia_3.json added to the list. 182/218 processed...
../data\SC_Columbia_4.json added to the list. 183/218 processed...
../data\TN_Nashville_0.json added to the list. 184/218 processed...
../data\TN_Nashville_1.json added to the list. 185/218 processed...
../data\TN_Nashville_2.json added to the list. 186/218 processed...
../data\TN_Nashville_3.json added to the list. 187/218 processed...
../data\TN_Nashville_4.json added to the list. 188/218 processed...
../data\TX_Austin_0.json added to the list. 189/218 processed...
../data\TX_Austin_1.json added to the list. 190/218 processed...
../data\TX_Austin_2.json added to the list. 191/218 processed...
../data\TX_Austin_3.json added to the list. 192/218 processed...
../data\TX_Austin_4.json added to the list. 193/218 processed...
../data\UT_SaltLakeCity_0.json added to the list. 194/218 processed...
../data\UT_SaltLakeCity_1.json added to the list. 195/218 processed...
../data\UT_SaltLakeCity_2.json added to the list. 196/218 processed...
../data\UT_SaltLakeCity_3.json added to the list. 197/218 processed...
../data\UT_SaltLakeCity_4.json added to the list. 198/218 processed...
../data\VA_Richmond_0.json added to the list. 199/218 processed...
../data\VA_Richmond_1.json added to the list. 200/218 processed...
../data\VA_Richmond_2.json added to the list. 201/218 processed...
../data\VA_Richmond_3.json added to the list. 202/218 processed...
../data\VA_Richmond_4.json added to the list. 203/218 processed...
../data\WA_Olympia_0.json added to the list. 204/218 processed...
../data\WA_Olympia_1.json added to the list. 205/218 processed...
../data\WA_Olympia_2.json added to the list. 206/218 processed...
../data\WA_Olympia_3.json added to the list. 207/218 processed...
../data\WA_Olympia_4.json added to the list. 208/218 processed...
../data\WI_Madison_0.json added to the list. 209/218 processed...
../data\WI_Madison_1.json added to the list. 210/218 processed...
../data\WI_Madison_2.json added to the list. 211/218 processed...
../data\WI_Madison_3.json added to the list. 212/218 processed...
../data\WI_Madison_4.json added to the list. 213/218 processed...
../data\WV_Charleston_0.json added to the list. 214/218 processed...
../data\WV_Charleston_1.json added to the list. 215/218 processed...
../data\WV_Charleston_2.json added to the list. 216/218 processed...
../data\WV_Charleston_3.json added to the list. 217/218 processed...
../data\WV_Charleston_4.json added to the list. 218/218 processed...

218 files loaded into the list of DataFrames.

In [459]:
housing_dataset = pd.concat(combine_all, ignore_index=True)

housing_dataset.shape

C:\Users\kadm2\AppData\Local\Temp\ipykernel_16132\3315332010.py:1: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  housing_dataset = pd.concat(combine_all, ignore_index=True)

(8159, 67)

#### - Saving outputs...

In [460]:
output_path = '../outputs'

# --- !!! Uncomment only when saving. Run once and put the # back. !!! --- #
# housing_dataset.to_csv(os.path.join(output_path, 'housing_dataset.csv'), index=False)

#### - Load

In [461]:
housing_df = pd.read_csv(os.path.join(output_path, 'housing_dataset.csv'))

housing_df.shape

(8159, 67)

## Data Cleaning and Wrangling

At this point, ensure that you have all sales in a dataframe.
- Take a quick look at your data (i.e. `.info()`, `.describe()`) - what do you see?
- Is each cell one value, or do some cells have lists?
- What are the data types of each column?
- Some sales may not actually include the sale price (target).  These rows should be dropped.
- There are a lot of NA/None values.  Should these be dropped or replaced with something?
    - You can drop rows or use various methods to fills NA's - use your best judgement for each column 
    - i.e. for some columns (like Garage), NA probably just means no Garage, so 0
- Drop columns that aren't needed
    - Don't keep the list price because it will be too close to the sale price. Assume we want to predict the price of houses not yet listed

#### - Quick look at the data and the values in them.

In [462]:
data = housing_df.copy()

In [463]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8159 entries, 0 to 8158
Data columns (total 67 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   last_update_date                       8125 non-null   object
 1   tags                                   7638 non-null   object
 2   permalink                              8159 non-null   object
 3   status                                 8159 non-null   object
 4   list_date                              7752 non-null   object
 5   open_houses                            0 non-null      float64
 6   branding                               8159 non-null   object
 7   list_price                             7721 non-null   float64
 8   property_id                            8159 non-null   int64
 9   photos                                 7403 non-null   object
 10  community                              0 non-null      float64
 11  virtual_tours                          1351 non-null   object
 12  listing_id                             7752 non-null   float64
 13  price_reduced_amount                   2484 non-null   float64
 14  matterport                             8159 non-null   bool
 15  primary_photo.href                     7403 non-null   object
 16  source.plan_id                         5 non-null      float64
 17  source.agents                          7752 non-null   object
 18  source.spec_id                         5 non-null      object
 19  source.type                            7752 non-null   object
 20  description.year_built                 7316 non-null   float64
 21  description.baths_3qtr                 566 non-null    float64
 22  description.sold_date                  8159 non-null   object
 23  description.sold_price                 6716 non-null   float64
 24  description.baths_full                 7311 non-null   float64
 25  description.name                       0 non-null      float64
 26  description.baths_half                 2281 non-null   float64
 27  description.lot_sqft                   6991 non-null   float64
 28  description.sqft                       7323 non-null   float64
 29  description.baths                      7980 non-null   float64
 30  description.sub_type                   1427 non-null   object
 31  description.baths_1qtr                 0 non-null      float64
 32  description.garage                     4448 non-null   float64
 33  description.stories                    6260 non-null   float64
 34  description.beds                       7504 non-null   float64
 35  description.type                       8125 non-null   object
 36  lead_attributes.show_contact_an_agent  8159 non-null   bool
 37  flags.is_new_construction              0 non-null      float64
 38  flags.is_for_rent                      0 non-null      float64
 39  flags.is_subdivision                   0 non-null      float64
 40  flags.is_contingent                    0 non-null      float64
 41  flags.is_price_reduced                 2484 non-null   object
 42  flags.is_pending                       0 non-null      float64
 43  flags.is_foreclosure                   42 non-null     object
 44  flags.is_plan                          0 non-null      float64
 45  flags.is_coming_soon                   0 non-null      float64
 46  flags.is_new_listing                   7752 non-null   object
 47  products.brand_name                    7673 non-null   object
 48  other_listings.rdc                     7856 non-null   object
 49  location.address.postal_code           8159 non-null   int64
 50  location.address.state                 8159 non-null   object
 51  location.address.coordinate.lon        7909 non-null   float64
 52  location.address.coordinate.lat        7909 non-null   float64
 53  location.address.city                  8154 non-null   object
 54  location.address.state_code            8159 non-null   object
 55  location.address.line                  8144 non-null   object
 56  location.street_view_url               8159 non-null   object
 57  location.county.fips_code              7588 non-null   float64
 58  location.county.name                   8149 non-null   object
 59  primary_photo                          0 non-null      float64
 60  source                                 0 non-null      float64
 61  products                               0 non-null      float64
 62  location.address.coordinate            0 non-null      float64
 63  other_listings                         0 non-null      float64
 64  community.advertisers                  5 non-null      object
 65  community.description.name             5 non-null      object
 66  location.county                        0 non-null      float64
dtypes: bool(2), float64(35), int64(2), object(28)
memory usage: 4.1+ MB

In [464]:
data.describe()

,open_houses,list_price,property_id,community,listing_id,price_reduced_amount,source.plan_id,description.year_built,description.baths_3qtr,description.sold_price,...,location.address.postal_code,location.address.coordinate.lon,location.address.coordinate.lat,location.county.fips_code,primary_photo,source,products,location.address.coordinate,other_listings,location.county
count,0.0,7.721000e+03,8.159000e+03,0.0,7.752000e+03,2.484000e+03,5.000000e+00,7316.000000,566.000000,6.716000e+03,...,8159.000000,7909.000000,7909.000000,7588.000000,0.0,0.0,0.0,0.0,0.0,0.0
mean,NaN,4.341582e+05,5.755508e+09,NaN,2.957819e+09,2.442704e+04,4.170007e+11,1968.916074,1.247350,4.126050e+05,...,50946.997181,-92.206522,39.009689,28000.253295,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,5.514925e+05,2.687366e+09,NaN,7.541620e+07,7.162396e+04,0.000000e+00,35.096914,0.463482,6.994308e+05,...,29257.110670,15.888886,4.374553,15586.751739,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,1.000000e+00,1.003443e+09,NaN,6.052327e+08,1.000000e+02,4.170007e+11,1828.000000,1.000000,3.080000e+02,...,2111.000000,-157.810583,21.277707,1101.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,2.090000e+05,3.307743e+09,NaN,2.959499e+09,6.000000e+03,4.170007e+11,1950.000000,1.000000,1.910000e+05,...,25314.000000,-104.971611,35.688084,16001.000000,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,3.250000e+05,6.000993e+09,NaN,2.960836e+09,1.010000e+04,4.170007e+11,1975.000000,1.000000,3.140000e+05,...,50310.000000,-89.333131,39.698210,27123.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,4.999000e+05,8.169927e+09,NaN,2.961805e+09,2.000000e+04,4.170007e+11,1997.000000,1.000000,4.700000e+05,...,78739.000000,-78.617690,41.832266,41047.000000,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,1.250000e+07,9.993679e+09,NaN,2.963230e+09,2.015999e+06,4.170007e+11,2024.000000,3.000000,2.706500e+07,...,99801.000000,-71.006343,58.396178,55025.000000,NaN,NaN,NaN,NaN,NaN,NaN

In [465]:
u = data.nunique()

for i in u.index:
  print(f'{u[i]} :: :: :: {i}')

1716 :: :: :: last_update_date
1628 :: :: :: tags
1795 :: :: :: permalink
1 :: :: :: status
1636 :: :: :: list_date
0 :: :: :: open_houses
996 :: :: :: branding
711 :: :: :: list_price
1795 :: :: :: property_id
1627 :: :: :: photos
0 :: :: :: community
290 :: :: :: virtual_tours
1704 :: :: :: listing_id
145 :: :: :: price_reduced_amount
2 :: :: :: matterport
1627 :: :: :: primary_photo.href
1 :: :: :: source.plan_id
393 :: :: :: source.agents
1 :: :: :: source.spec_id
1 :: :: :: source.type
147 :: :: :: description.year_built
3 :: :: :: description.baths_3qtr
127 :: :: :: description.sold_date
738 :: :: :: description.sold_price
8 :: :: :: description.baths_full
0 :: :: :: description.name
5 :: :: :: description.baths_half
743 :: :: :: description.lot_sqft
1119 :: :: :: description.sqft
10 :: :: :: description.baths
2 :: :: :: description.sub_type
0 :: :: :: description.baths_1qtr
9 :: :: :: description.garage
7 :: :: :: description.stories
13 :: :: :: description.beds
11 :: :: :: description.type
2 :: :: :: lead_attributes.show_contact_an_agent
0 :: :: :: flags.is_new_construction
0 :: :: :: flags.is_for_rent
0 :: :: :: flags.is_subdivision
0 :: :: :: flags.is_contingent
2 :: :: :: flags.is_price_reduced
0 :: :: :: flags.is_pending
1 :: :: :: flags.is_foreclosure
0 :: :: :: flags.is_plan
0 :: :: :: flags.is_coming_soon
1 :: :: :: flags.is_new_listing
4 :: :: :: products.brand_name
1726 :: :: :: other_listings.rdc
492 :: :: :: location.address.postal_code
45 :: :: :: location.address.state
1728 :: :: :: location.address.coordinate.lon
1729 :: :: :: location.address.coordinate.lat
101 :: :: :: location.address.city
45 :: :: :: location.address.state_code
1789 :: :: :: location.address.line
1792 :: :: :: location.street_view_url
65 :: :: :: location.county.fips_code
68 :: :: :: location.county.name
0 :: :: :: primary_photo
0 :: :: :: source
0 :: :: :: products
0 :: :: :: location.address.coordinate
0 :: :: :: other_listings
1 :: :: :: community.advertisers
1 :: :: :: community.description.name
0 :: :: :: location.county

In [466]:
# Quick look at the columns and the data in it -- Using a custom function, it sorts the df by the number of unique values in each column as well. 
columns_overview = cols_overview(data)

columns_overview.head()

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
66,8159,location.county,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
10,8159,community,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
25,8159,description.name,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
37,8159,flags.is_new_construction,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
38,8159,flags.is_for_rent,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"

##### - Pre-cleaning, Dropping rows.

> Some sales may not actually include the sale price (target).  These rows should be dropped.

> Don't keep the list price because it will be too close to the sale price.

In [467]:
drop_cols = ['list_price',
             'source.type', 
             'source.agents', 
             'last_update_date', 
             'price_reduced_amount',
             'other_listings.rdc',
             'last_update_date',
             'location.street_view_url',
             'matterport',
             'products.brand_name',
             'lead_attributes.show_contact_an_agent',
             'permalink',
             'virtual_tours',
             'location.address.line',
             'description.sub_type',
             'flags.is_new_listing']

# Dropped location.address.line because we don't need it. Lat/Lon is enough.

data.drop(drop_cols, axis=1, inplace=True)
data.shape

(8159, 52)

#### - Missing sold_price

In [468]:
data['description.sold_price'].isnull().sum()

1443

In [469]:
missing_sold_price = data[data['description.sold_price'].isnull()]

missing_sold_price

,tags,status,list_date,open_houses,branding,property_id,photos,community,listing_id,primary_photo.href,...,location.county.fips_code,location.county.name,primary_photo,source,products,location.address.coordinate,other_listings,community.advertisers,community.description.name,location.county
0,"['carport', 'community_outdoor_space', 'cul_de...",sold,2023-06-29T21:16:25.000000Z,NaN,"[{'name': 'EXP Realty LLC - Southeast Alaska',...",9074430767,"[{'tags': [{'label': 'house_view', 'probabilit...",NaN,2.957242e+09,https://ap.rdcpix.com/07097d34c98a59ebb7996889...,...,NaN,Juneau,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,sold,NaN,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9424983842,NaN,NaN,NaN,NaN,...,NaN,Juneau,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,sold,NaN,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9479068516,NaN,NaN,NaN,NaN,...,NaN,Juneau,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,sold,NaN,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9879331943,NaN,NaN,NaN,NaN,...,NaN,Juneau,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,sold,NaN,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9521639574,NaN,NaN,NaN,NaN,...,NaN,Juneau,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7320,"['central_air', 'central_heat', 'community_out...",sold,2023-07-07T02:16:44.000000Z,NaN,"[{'name': 'Dijjit, LC', 'photo': None, 'type':...",1834972490,NaN,NaN,2.957450e+09,NaN,...,49035.0,Salt Lake,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7321,"['central_air', 'community_outdoor_space', 'la...",sold,2023-10-19T21:08:10.000000Z,NaN,"[{'name': ""Summit Sotheby's International Real...",2597824245,NaN,NaN,2.960709e+09,NaN,...,49035.0,Salt Lake,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7322,"['central_heat', 'community_outdoor_space', 'l...",sold,2023-10-15T00:55:32.000000Z,NaN,"[{'name': 'RED ROCK REAL ESTATE', 'photo': Non...",1641410738,NaN,NaN,2.960567e+09,NaN,...,49035.0,Salt Lake,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7323,"['rental_property', 'investment_opportunity', ...",sold,2023-10-11T21:16:02.000000Z,NaN,"[{'name': 'Investment Realty Advisors LLC', 'p...",1479984642,NaN,NaN,2.960458e+09,NaN,...,49035.0,Salt Lake,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7324,"['central_air', 'community_outdoor_space', 'fi...",sold,2023-10-15T15:46:03.000000Z,NaN,"[{'name': 'EXIT REALTY SUCCESS', 'photo': 'htt...",1262473485,NaN,NaN,2.960571e+09,NaN,...,49035.0,Salt Lake,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [470]:
# Drop rows where 'description.sold_price' is NaN
data.dropna(subset=['description.sold_price'], inplace=True)

In [471]:
data.shape

(6716, 52)

#### Dealing with Nulls

In [472]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head()

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
51,6716,location.county,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
46,6716,products,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
32,6716,flags.is_pending,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
30,6716,flags.is_contingent,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
29,6716,flags.is_subdivision,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"

##### - 6716 nulls (17 Empty columns)

In [473]:
empties = columns_overview[columns_overview['nulls_count'] == data.shape[0]]

empties.head()

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
51,6716,location.county,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
46,6716,products,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
32,6716,flags.is_pending,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
30,6716,flags.is_contingent,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
29,6716,flags.is_subdivision,float64,0,[nan],"[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"

In [474]:
is_empty = [i for i in empties['col_name']]

len(is_empty), is_empty

(17,
 ['location.county',
  'products',
  'flags.is_pending',
  'flags.is_contingent',
  'flags.is_subdivision',
  'flags.is_for_rent',
  'flags.is_new_construction',
  'description.baths_1qtr',
  'primary_photo',
  'flags.is_coming_soon',
  'source',
  'description.name',
  'flags.is_plan',
  'other_listings',
  'open_houses',
  'location.address.coordinate',
  'community'])

In [475]:
# Drop the columns that are empty
data.drop(columns=is_empty, inplace=True)

data.shape[1] # From 58

35

In [476]:
# Drop removed columns from columns_overview
columns_overview.drop(index=empties.index, inplace=True)

columns_overview.shape

(35, 7)

In [477]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head()

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
34,6711,community.description.name,object,1,"[nan, Woods of Copper Creek]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
33,6711,community.advertisers,object,1,"[nan, [{'office': {'hours': 'Monday - Saturday...","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
8,6711,source.plan_id,float64,1,"[nan, 417000743767.0]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
9,6711,source.spec_id,object,1,"[nan, 365-36546-365750000-0016]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
24,6686,flags.is_foreclosure,object,1,"[nan, True]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"

##### - 6711 Nulls : `['community.description.name', 'source.plan_id', 'source.spec_id', 'community.advertisers']`

In [478]:
remove = columns_overview[columns_overview['nulls_count'] == 6711]['col_name']

remove_cols = [i for i in remove]
remove_cols

['community.description.name',
 'community.advertisers',
 'source.plan_id',
 'source.spec_id']

In [479]:
data.drop(columns=remove_cols, inplace=True)

data.shape[1] # From 41

31

In [480]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head()

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
22,6686,flags.is_foreclosure,object,1,"[nan, True]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
9,6343,description.baths_3qtr,float64,2,"[nan, 2.0, 1.0]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
13,4739,description.baths_half,float64,5,"[nan, 1.0, 2.0, 3.0, 4.0, 5.0]","[nan, nan, nan, nan, nan]","[nan, nan, nan, nan, nan]"
21,4706,flags.is_price_reduced,object,2,"[nan, False, True]","[nan, False, nan, False, False]","[nan, nan, nan, nan, nan]"
17,3231,description.garage,float64,9,"[2.0, 1.0, nan, 3.0, 4.0, 5.0, 9.0, 8.0, 6.0, ...","[2.0, 1.0, nan, nan, nan]","[1.0, nan, nan, nan, nan]"

##### - 6686 Nulls : `'flags.is_foreclosure'`

In [481]:
# The flags.is_foreclosure may be useful. It may have effect with the house price. Replacing the Nan values with 0 and 1.
data['flags.is_foreclosure'] = data['flags.is_foreclosure'].fillna(0).replace({True: 1})

data['flags.is_foreclosure'].unique()

C:\Users\kadm2\AppData\Local\Temp\ipykernel_16132\318830356.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['flags.is_foreclosure'] = data['flags.is_foreclosure'].fillna(0).replace({True: 1})

array([0, 1], dtype=int64)

##### - 6343 Nulls : `'description.baths_3qtr'`

In [482]:
# Replacing the NaN values with 0
data['description.baths_3qtr'] = data['description.baths_3qtr'].fillna(0.)

data['description.baths_3qtr'].unique()

array([0., 2., 1.])

##### - 4739 Nulls : `'description.baths_half'`

In [483]:
# It's possible to have 0 half baths. Replacing the NaN values with 0
data['description.baths_half'] = data['description.baths_half'].fillna(0.)

data['description.baths_half'].unique(), data['description.baths_half'].isnull().sum()

(array([0., 1., 2., 3., 4., 5.]), 0)

##### - 4706 Nulls : `['flags.is_price_reduced']`

In [484]:
# These columns appear to be related.
compare = data[~data['flags.is_price_reduced'].isnull()]

compare['flags.is_price_reduced'].shape

(2010,)

In [485]:
# Null values + Values that are not null should equal the total number of rows in the dataset.
4706 + 2010 == 6716 # All the nulls are in the same rows. Replacing the NaN values with 0 on 'price_reduced_amount' and False on 'flags.is_price_reduced'

True

In [486]:
# Replacing the NaN values with False
data['flags.is_price_reduced'] = data['flags.is_price_reduced'].fillna(False)

C:\Users\kadm2\AppData\Local\Temp\ipykernel_16132\2118188274.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['flags.is_price_reduced'] = data['flags.is_price_reduced'].fillna(False)

In [487]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head()

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
17,3231,description.garage,float64,9,"[2.0, 1.0, nan, 3.0, 4.0, 5.0, 9.0, 8.0, 6.0, ...","[2.0, 1.0, nan, nan, nan]","[1.0, nan, nan, nan, nan]"
18,1617,description.stories,float64,7,"[1.0, 2.0, nan, 3.0, 10.0, 6.0, 8.0, 4.0]","[1.0, 2.0, 1.0, 1.0, 1.0]","[2.0, nan, nan, nan, nan]"
14,922,description.lot_sqft,float64,609,"[11761.0, 6534.0, 17424.0, 9712.0, 10890.0, 12...","[11761.0, 6534.0, 17424.0, 9712.0, 10890.0]","[4792.0, 7841.0, 65340.0, nan, 52272.0]"
12,677,description.baths_full,float64,7,"[2.0, nan, 1.0, 3.0, 4.0, 5.0, 6.0, 7.0]","[2.0, 2.0, 2.0, 2.0, 2.0]","[1.0, 1.0, 1.0, nan, 2.0]"
8,675,description.year_built,float64,144,"[1998.0, 1945.0, 1969.0, 1955.0, 1984.0, 1999....","[1998.0, 1945.0, 1969.0, 1955.0, 1984.0]","[1910.0, nan, nan, nan, 1950.0]"

##### - 3231 Nulls : `'description.garage'`

In [488]:
# # We can assume Nan means no garage. Replacing the NaN values with 0
data['description.garage'] = data['description.garage'].fillna(0.)

##### - 1617 Nulls : `'description.stories'`

In [489]:
data['description.stories'].unique() # No 0 stories. Replacing the NaN values with 0

array([ 1.,  2., nan,  3., 10.,  6.,  8.,  4.])

In [490]:
data['description.stories'] = data['description.stories'].fillna(0.)

data['description.stories'].unique(), data['description.stories'].isnull().sum()

(array([ 1.,  2.,  0.,  3., 10.,  6.,  8.,  4.]), 0)

##### - 1168 & 655 Nulls : `['description.lot_sqft', 'description.sqft']`

In [491]:
# Columns appear to be related, may be redundant.
lot_sizes = data[data[['description.lot_sqft', 'description.sqft']].isnull().any(axis=1)]

lot_sizes[['description.lot_sqft', 'description.sqft']]

      description.lot_sqft  description.sqft
40               3397680.0               NaN
81               3397680.0               NaN
121              3397680.0               NaN
162              3397680.0               NaN
203              3397680.0               NaN
...                    ...               ...
8147               18295.0               NaN
8150                8276.0               NaN
8151                   NaN             771.0
8152                   NaN            1664.0
8157                   NaN               NaN

[1286 rows x 2 columns]

In [492]:
lot_sizes.loc[:, 'check_property.sqft'] = lot_sizes['description.lot_sqft'] == lot_sizes['description.sqft']

lot_sizes[lot_sizes['check_property.sqft']==True]

C:\Users\kadm2\AppData\Local\Temp\ipykernel_16132\197350453.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  lot_sizes.loc[:, 'check_property.sqft'] = lot_sizes['description.lot_sqft'] == lot_sizes['description.sqft']

Empty DataFrame
Columns: [tags, status, list_date, branding, property_id, photos, listing_id, primary_photo.href, description.year_built, description.baths_3qtr, description.sold_date, description.sold_price, description.baths_full, description.baths_half, description.lot_sqft, description.sqft, description.baths, description.garage, description.stories, description.beds, description.type, flags.is_price_reduced, flags.is_foreclosure, location.address.postal_code, location.address.state, location.address.coordinate.lon, location.address.coordinate.lat, location.address.city, location.address.state_code, location.county.fips_code, location.county.name, check_property.sqft]
Index: []

[0 rows x 32 columns]

In [493]:
# Merge 'description.lot_sqft' and 'description.sqft' into a new column 'property.sqft'
data['property.sqft'] = data['description.lot_sqft'].combine_first(data['description.sqft'])

data['property.sqft'].isnull().sum()

291

In [494]:
drop_cols = ['description.lot_sqft', 'description.sqft']

data.drop(columns=drop_cols, inplace=True)

##### - 291 Nulls : `'property.sqft'`

In [495]:
leftover_missing_sqft = data[data['property.sqft'].isnull()]

# Drop rows where 'property.sqft' is NaN
data.dropna(subset=['property.sqft'], inplace=True)

##### - 677 Nulls : `'description.baths_full'`

In [496]:
# Replacing the NaN values with 0
data['description.baths_full'] = data['description.baths_full'].fillna(0.)

In [497]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head(10)

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
8,463,description.year_built,float64,144,"[1998.0, 1945.0, 1969.0, 1955.0, 1984.0, 1999....","[1998.0, 1945.0, 1969.0, 1955.0, 1984.0]","[nan, 1910.0, nan, nan, 1950.0]"
27,404,location.county.fips_code,float64,54,"[1101.0, 5119.0, nan, 5125.0, 4013.0, 6067.0, ...","[1101.0, 1101.0, 1101.0, 1101.0, 1101.0]","[54039.0, 54039.0, 54039.0, 54039.0, 54039.0]"
17,321,description.beds,float64,13,"[3.0, 4.0, nan, 2.0, 5.0, 1.0, 6.0, 12.0, 7.0,...","[3.0, 4.0, 3.0, 3.0, 3.0]","[5.0, 3.0, 3.0, 3.0, 3.0]"
5,286,photos,object,1349,"[nan, [{'tags': [{'label': 'house_view', 'prob...","[nan, [{'tags': [{'label': 'house_view', 'prob...","[[{'tags': [{'label': 'house_view', 'probabili..."
7,286,primary_photo.href,object,1349,"[nan, https://ap.rdcpix.com/a5fe1391acf35d43ee...","[nan, https://ap.rdcpix.com/a5fe1391acf35d43ee...",[https://ap.rdcpix.com/43df1ac3415036d0fdba271...
0,189,tags,object,1339,"[['central_air', 'central_heat', 'community_ou...","[['central_air', 'central_heat', 'community_ou...","[['basement', 'garage_1_or_more', 'garage_2_or..."
6,125,listing_id,float64,1385,"[622475855.0, 2961522977.0, 619793175.0, 29573...","[622475855.0, 2961522977.0, 619793175.0, 29573...","[2954540283.0, 2954257214.0, 2956178043.0, 295..."
2,125,list_date,object,1338,"[2023-12-19T18:08:22.000000Z, 2023-11-10T14:20...","[2023-12-19T18:08:22.000000Z, 2023-11-10T14:20...","[2023-04-13T18:27:22Z, 2023-04-05T19:28:04Z, 2..."
14,120,description.baths,float64,10,"[2.0, 3.0, 0.0, 1.0, 4.0, 5.0, nan, 6.0, 7.0, ...","[2.0, 2.0, 2.0, 2.0, 2.0]","[2.0, 1.0, 1.0, 1.0, 2.0]"
24,99,location.address.coordinate.lat,float64,1384,"[32.389075, 32.382748, 32.380023, 32.386844, 3...","[32.389075, 32.382748, 32.380023, 32.386844, 3...","[38.366388, 38.341576, 38.377371, 38.338617, 3..."

##### - 675 Nulls : `'description.year_built'`

In [498]:
# data[data['description.year_built'].isnull()]

In [499]:
# I'll fill the values with the median year built in the dataset, based the city.
# Calculate the median year built for each city, excluding NaN values
median_year_built_by_city = data.groupby('location.address.city')['description.year_built'].transform('median')

# Replace NaN values in 'description.year_built' with the median year built for the corresponding city
data['description.year_built'] = data['description.year_built'].fillna(median_year_built_by_city)

In [500]:
data['description.year_built'].isnull().sum()

37

In [501]:
# There are 85 rows with NaN values in 'description.year_built'. I'll fill them with the median year built in the dataset.
# Calculate the overall median year built, excluding NaN values
overall_median_year_built = data['description.year_built'].median()

# Replace remaining NaN values in 'description.year_built' with the overall median year built
data['description.year_built'] = data['description.year_built'].fillna(overall_median_year_built)

In [502]:
data['description.year_built'].isnull().sum()

0

##### - 443 Nulls : `['primary_photo.href', 'photos']`

In [503]:
# These columns appear to be related.
compare = data[~data[['primary_photo.href', 'photos']].isnull().all(axis=1)]

compare[['primary_photo.href', 'photos']].shape

(6139, 2)

In [504]:
443 + 6273 == 6716 # All the nulls are in the same rows. Creating a new column 'has_photos' which will be 0 or 1, and then dropping both columns.

True

In [505]:
data['has_photos'] = data['photos'].notnull().astype(int)

data['has_photos'].unique()

array([0, 1])

In [506]:
data.drop(columns=['primary_photo.href', 'photos'], inplace=True)

##### - 493 Nulls : `'description.beds'`

In [507]:
check_type = data[data['description.beds'].isnull()] # Null values in 'description.beds'
review = check_type[['description.beds', 'description.type']] # Checking the  type of the property

review['description.type'].unique()

array(['land', 'multi_family', 'single_family', 'other', 'mobile'],
      dtype=object)

In [508]:
# Group by type and calculate the median number of beds for each type
median_beds_by_type = data.groupby('description.type')['description.beds'].transform('median')

# Replace NaN values in 'description.beds' with the median number of beds for the corresponding type
data['description.beds'] = data['description.beds'].fillna(median_beds_by_type)

data['description.beds'].isnull().sum()

5

In [509]:
data[data['description.beds'].isnull()]

,tags,status,list_date,branding,property_id,listing_id,description.year_built,description.baths_3qtr,description.sold_date,description.sold_price,...,location.address.postal_code,location.address.state,location.address.coordinate.lon,location.address.coordinate.lat,location.address.city,location.address.state_code,location.county.fips_code,location.county.name,property.sqft,has_photos
2376,NaN,sold,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9515169963,NaN,1974.0,0.0,2023-07-24,275000.0,...,62703,Illinois,-89.651613,39.78819,Springfield,IL,17167.0,Sangamon,9614.0,0
2412,NaN,sold,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9515169963,NaN,1974.0,0.0,2023-07-24,275000.0,...,62703,Illinois,-89.651613,39.78819,Springfield,IL,17167.0,Sangamon,9614.0,0
2447,NaN,sold,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9515169963,NaN,1974.0,0.0,2023-07-24,275000.0,...,62703,Illinois,-89.651613,39.78819,Springfield,IL,17167.0,Sangamon,9614.0,0
2481,NaN,sold,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9515169963,NaN,1974.0,0.0,2023-07-24,275000.0,...,62703,Illinois,-89.651613,39.78819,Springfield,IL,17167.0,Sangamon,9614.0,0
2514,NaN,sold,NaN,"[{'name': None, 'photo': None, 'type': 'Office'}]",9515169963,NaN,1974.0,0.0,2023-07-24,275000.0,...,62703,Illinois,-89.651613,39.78819,Springfield,IL,17167.0,Sangamon,9614.0,0

In [510]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head(10)

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
25,404,location.county.fips_code,float64,54,"[1101.0, 5119.0, nan, 5125.0, 4013.0, 6067.0, ...","[1101.0, 1101.0, 1101.0, 1101.0, 1101.0]","[54039.0, 54039.0, 54039.0, 54039.0, 54039.0]"
0,189,tags,object,1339,"[['central_air', 'central_heat', 'community_ou...","[['central_air', 'central_heat', 'community_ou...","[['basement', 'garage_1_or_more', 'garage_2_or..."
2,125,list_date,object,1338,"[2023-12-19T18:08:22.000000Z, 2023-11-10T14:20...","[2023-12-19T18:08:22.000000Z, 2023-11-10T14:20...","[2023-04-13T18:27:22Z, 2023-04-05T19:28:04Z, 2..."
5,125,listing_id,float64,1385,"[622475855.0, 2961522977.0, 619793175.0, 29573...","[622475855.0, 2961522977.0, 619793175.0, 29573...","[2954540283.0, 2954257214.0, 2956178043.0, 295..."
12,120,description.baths,float64,10,"[2.0, 3.0, 0.0, 1.0, 4.0, 5.0, nan, 6.0, 7.0, ...","[2.0, 2.0, 2.0, 2.0, 2.0]","[2.0, 1.0, 1.0, 1.0, 2.0]"
22,99,location.address.coordinate.lat,float64,1384,"[32.389075, 32.382748, 32.380023, 32.386844, 3...","[32.389075, 32.382748, 32.380023, 32.386844, 3...","[38.366388, 38.341576, 38.377371, 38.338617, 3..."
21,99,location.address.coordinate.lon,float64,1383,"[-86.178412, -86.273286, -86.221454, -86.28438...","[-86.178412, -86.273286, -86.221454, -86.28438...","[-81.643303, -81.644994, -81.661662, -81.65988..."
26,10,location.county.name,object,55,"[Montgomery, Pulaski, Saline, Maricopa, Sacram...","[Montgomery, Montgomery, Montgomery, Montgomer...","[Kanawha, Kanawha, Kanawha, Kanawha, Kanawha]"
23,5,location.address.city,object,82,"[Montgomery, Little Rock, Mabelvale, Alexander...","[Montgomery, Montgomery, Montgomery, Montgomer...","[Charleston, Charleston, Charleston, Charlesto..."
15,5,description.beds,float64,13,"[3.0, 4.0, 2.0, 5.0, 1.0, 6.0, 12.0, 7.0, 8.0,...","[3.0, 4.0, 3.0, 3.0, 3.0]","[5.0, 3.0, 3.0, 3.0, 3.0]"

In [511]:
# Needs further investigation

##### - 179 Nulls : `'description.baths'`

In [512]:
# Look into all the columns that have 'baths' in the name.
data.columns[data.columns.str.contains('baths')]

Index(['description.baths_3qtr', 'description.baths_full',
       'description.baths_half', 'description.baths'],
      dtype='object')

In [513]:
data[['description.baths_3qtr', 'description.baths_full', 'description.baths_half', 'description.baths']].describe()

,description.baths_3qtr,description.baths_full,description.baths_half,description.baths
count,6425.000000,6425.000000,6425.000000,6305.000000
mean,0.073774,1.741323,0.332607,2.185408
std,0.315891,0.947738,0.540141,1.115353
min,0.000000,0.000000,0.000000,0.000000
25%,0.000000,1.000000,0.000000,2.000000
50%,0.000000,2.000000,0.000000,2.000000
75%,0.000000,2.000000,1.000000,3.000000
max,2.000000,7.000000,5.000000,9.000000

In [514]:
# Redundant columns. It looks like 'description.baths' is the sum of 'description.baths_3qtr', 'description.baths_full', and 'description.baths_half'. Adding all 3 to fill the NaN values in 'description.baths'.
data['description.baths'] = data['description.baths'].fillna(data['description.baths_3qtr'] + data['description.baths_full'] + data['description.baths_half'])

data['description.baths'].isnull().sum()

0

##### - 125 Nulls : `'list_date'`

In [515]:
data['list_date'].isnull().sum()

125

In [516]:
# Converting list_date to datetime
data['list_date'] = pd.to_datetime(data['list_date'], errors='coerce')

In [517]:
# FIlling null values with median list_date in the city.
mean_list_date_by_city = data.groupby('location.address.city')['list_date'].transform('mean')

data['list_date'] = data['list_date'].fillna(mean_list_date_by_city)

data['list_date'].isnull().sum()

59

In [518]:
# Filling the rest of the null values with the median list_date in the dataset.
overall_mean_list_date = data['list_date'].mean()

data['list_date'] = data['list_date'].fillna(overall_mean_list_date)

data['list_date'].isnull().sum()

0

##### - 34 Nulls : `'description.type'`

In [519]:
data['description.type'].unique()

array(['single_family', 'land', 'townhomes', 'multi_family', 'apartment',
       'mobile', 'condos', 'other', 'duplex_triplex',
       'condo_townhome_rowhome_coop', 'condo'], dtype=object)

In [520]:
# Replacing the NaN values with other
data['description.type'] = data['description.type'].fillna('other')

data['description.type'].unique(), data['description.type'].isnull().sum()

(array(['single_family', 'land', 'townhomes', 'multi_family', 'apartment',
        'mobile', 'condos', 'other', 'duplex_triplex',
        'condo_townhome_rowhome_coop', 'condo'], dtype=object),
 0)

##### - Address-related

10 Nulls : `'location.county.name'`

In [521]:
# Check with other columns.
county = data[data[['location.county.name', 'location.address.state']].isnull().any(axis=1)]

# county[['location.address.city', 'location.county.name', 'location.address.state']]

In [522]:
# Calculate the mode city for each group of county name and state
median_county_by_group = data.groupby(['location.address.city', 'location.address.state'])['location.county.name'].transform(lambda x: x.mode().iloc[0])

# Replace NaN values in 'location.address.city' with the mode city for the corresponding group
data['location.county.name'] = data['location.county.name'].fillna(median_county_by_group)

data['location.county.name'].isnull().sum()

0

5 Nulls : `'location.address.city'`

In [523]:
# Check with other columns.
city = data[data[['location.address.city', 'location.county.name', 'location.address.state']].isnull().any(axis=1)]

# city[['location.address.city', 'location.county.name', 'location.address.state']]

In [524]:
# Calculate the mode city for each group of county name and state
median_city_by_group = data.groupby(['location.county.name', 'location.address.state'])['location.address.city'].transform(lambda x: x.mode().iloc[0])

# Replace NaN values in 'location.address.city' with the mode city for the corresponding group
data['location.address.city'] = data['location.address.city'].fillna(median_city_by_group)

data['location.address.city'].isnull().sum()

0

179 Nulls : `['location.address.coordinate.lon', 'location.address.coordinate.lat']`

In [525]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head(5)

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
25,404,location.county.fips_code,float64,54,"[1101.0, 5119.0, nan, 5125.0, 4013.0, 6067.0, ...","[1101.0, 1101.0, 1101.0, 1101.0, 1101.0]","[54039.0, 54039.0, 54039.0, 54039.0, 54039.0]"
0,189,tags,object,1339,"[['central_air', 'central_heat', 'community_ou...","[['central_air', 'central_heat', 'community_ou...","[['basement', 'garage_1_or_more', 'garage_2_or..."
5,125,listing_id,float64,1385,"[622475855.0, 2961522977.0, 619793175.0, 29573...","[622475855.0, 2961522977.0, 619793175.0, 29573...","[2954540283.0, 2954257214.0, 2956178043.0, 295..."
22,99,location.address.coordinate.lat,float64,1384,"[32.389075, 32.382748, 32.380023, 32.386844, 3...","[32.389075, 32.382748, 32.380023, 32.386844, 3...","[38.366388, 38.341576, 38.377371, 38.338617, 3..."
21,99,location.address.coordinate.lon,float64,1383,"[-86.178412, -86.273286, -86.221454, -86.28438...","[-86.178412, -86.273286, -86.221454, -86.28438...","[-81.643303, -81.644994, -81.661662, -81.65988..."

In [526]:
# Mean lat and lon for each city, state
mean_lat_by_state = data.groupby(['location.address.city', 'location.address.state'])['location.address.coordinate.lat'].transform('mean')
mean_lon_by_state = data.groupby(['location.address.city', 'location.address.state'])['location.address.coordinate.lon'].transform('mean')

# Replace NaN values in 'location.address.coordinate.lat' and 'location.address.coordinate.lon' with the mean lat and lon for the corresponding city
data['location.address.coordinate.lat'] = data['location.address.coordinate.lat'].fillna(mean_lat_by_state)
data['location.address.coordinate.lon'] = data['location.address.coordinate.lon'].fillna(mean_lon_by_state)

data[['location.address.coordinate.lat', 'location.address.coordinate.lon']].isnull().sum()

location.address.coordinate.lat    22
location.address.coordinate.lon    22
dtype: int64

In [527]:
lat = data[data['location.address.coordinate.lat'].isnull()]
lon = data[data['location.address.coordinate.lon'].isnull()]

lat.shape[0], lon.shape[0]

(22, 22)

In [528]:
# Mean lat and lon for each postal code
mean_lat_by_pc = data.groupby('location.address.postal_code')['location.address.coordinate.lat'].transform('mean')
mean_lon_by_pc = data.groupby('location.address.postal_code')['location.address.coordinate.lon'].transform('mean')

# Replace NaN values in 'location.address.coordinate.lat' and 'location.address.coordinate.lon' with the mean lat and lon for the corresponding city
data['location.address.coordinate.lat'] = data['location.address.coordinate.lat'].fillna(mean_lat_by_pc)
data['location.address.coordinate.lon'] = data['location.address.coordinate.lon'].fillna(mean_lon_by_pc)

data[['location.address.coordinate.lat', 'location.address.coordinate.lon']].isnull().sum()

location.address.coordinate.lat    14
location.address.coordinate.lon    14
dtype: int64

In [529]:
# Median lat and lon for each state for the rest of the NaN values
median_lat_by_state = data.groupby('location.address.state')['location.address.coordinate.lat'].transform('median')
median_lon_by_state = data.groupby('location.address.state')['location.address.coordinate.lon'].transform('median')

# Replace NaN values in 'location.address.coordinate.lat' and 'location.address.coordinate.lon' with the median lat and lon for the corresponding city
data['location.address.coordinate.lat'] = data['location.address.coordinate.lat'].fillna(median_lat_by_state)
data['location.address.coordinate.lon'] = data['location.address.coordinate.lon'].fillna(median_lon_by_state)

data['location.address.coordinate.lat'].isnull().sum(), data['location.address.coordinate.lon'].isnull().sum()

(0, 0)

##### - 484 Nulls : `'location.county.fips_code'` -- *Look again*

In [530]:
# data[['location.county.fips_code', 'location.county.name', 'location.address.city', 'location.address.state']]
# Some of the missing values in 'location.county.fips_code' can be filled by looking at the 'location.county.name' and 'location.address.city' columns where it matches.

In [531]:
fips_code_missing = data[data['location.county.fips_code'].isnull()]

fips_code_missing[['location.county.fips_code', 'location.county.name', 'location.address.city', 'location.address.state']].head()

,location.county.fips_code,location.county.name,location.address.city,location.address.state
251,NaN,Pulaski,Little Rock,Arkansas
262,NaN,Pulaski,Little Rock,Arkansas
292,NaN,Pulaski,Little Rock,Arkansas
303,NaN,Pulaski,Little Rock,Arkansas
333,NaN,Pulaski,Little Rock,Arkansas

In [532]:
# Calculate the median fips_code for each group of county name, city, and state
median_fips_by_group = data.groupby(['location.county.name', 'location.address.city', 'location.address.state'])['location.county.fips_code'].transform('median')

# Replace NaN values in 'location.county.fips_code' with the median fips_code for the corresponding group
data['location.county.fips_code'] = data['location.county.fips_code'].fillna(median_fips_by_group)

data['location.county.fips_code'].isnull().sum()

327

In [533]:
view = data[['location.county.fips_code', 'location.county.name', 'location.address.city', 'location.address.state']]

view = view[view['location.county.fips_code'].isnull()]

view

,location.county.fips_code,location.county.name,location.address.city,location.address.state
1961,NaN,Boone,Boone,Iowa
2003,NaN,Boone,Boone,Iowa
2009,NaN,Boone,Boone,Iowa
2043,NaN,Boone,Boone,Iowa
2050,NaN,Boone,Boone,Iowa
...,...,...,...,...
7979,NaN,Kanawha,Charlton Heights,West Virginia
8020,NaN,Kanawha,Charlton Heights,West Virginia
8061,NaN,Kanawha,Charlton Heights,West Virginia
8101,NaN,Kanawha,Charlton Heights,West Virginia
8140,NaN,Kanawha,Charlton Heights,West Virginia

In [534]:
view['location.county.name'].unique()

array(['Boone', 'Carson City', 'Hampton', 'Richmond City', 'Kanawha'],
      dtype=object)

In [535]:
# Missing fips code by location
county_boone = data[data['location.county.name'] == 'Boone']
county_carson = data[data['location.county.name'] == 'Carson City']
county_hampton = data[data['location.county.name'] == 'Hampton']
county_richmond = data[data['location.county.name'] == 'Richmond City']
county_kanawha = data[data['location.county.name'] == 'Kanawha']

# For indexing purposes
Boone = (data['location.county.name'] == 'Boone')
Carson_City = (data['location.county.name'] == 'Carson City')
Hampton = (data['location.county.name'] == 'Hampton')
Richmond_City = (data['location.county.name'] == 'Richmond City')
Kanawha = (data['location.county.name'] == 'Kanawha')

In [536]:
# FIPS Codes are unique to each county and is publicly available data. I'm filling the missing values manually.
# 19015 = Boone County, IA
data.loc[Boone, 'location.county.fips_code'] = data.loc[Boone, 'location.county.fips_code'].fillna(19015)

# 32510 = Carson City, NV
data.loc[Carson_City, 'location.county.fips_code'] = data.loc[Carson_City, 'location.county.fips_code'].fillna(32510)

# 45049 = Hampton, SC
data.loc[Hampton, 'location.county.fips_code'] = data.loc[Hampton, 'location.county.fips_code'].fillna(45049)

# 51760 = Richmond City, VA
data.loc[Richmond_City, 'location.county.fips_code'] = data.loc[Richmond_City, 'location.county.fips_code'].fillna(51159)

# 54039 = Kanawha, WV
data.loc[Kanawha, 'location.county.fips_code'] = data.loc[Kanawha, 'location.county.fips_code'].fillna(54039)

In [537]:
data['location.county.fips_code'].isnull().sum()

0

In [538]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head(5)

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
0,189,tags,object,1339,"[['central_air', 'central_heat', 'community_ou...","[['central_air', 'central_heat', 'community_ou...","[['basement', 'garage_1_or_more', 'garage_2_or..."
5,125,listing_id,float64,1385,"[622475855.0, 2961522977.0, 619793175.0, 29573...","[622475855.0, 2961522977.0, 619793175.0, 29573...","[2954540283.0, 2954257214.0, 2956178043.0, 295..."
15,5,description.beds,float64,13,"[3.0, 4.0, 2.0, 5.0, 1.0, 6.0, 12.0, 7.0, 8.0,...","[3.0, 4.0, 3.0, 3.0, 3.0]","[5.0, 3.0, 3.0, 3.0, 3.0]"
27,0,property.sqft,float64,734,"[11761.0, 6534.0, 17424.0, 9712.0, 10890.0, 12...","[11761.0, 6534.0, 17424.0, 9712.0, 10890.0]","[11326.0, 4792.0, 7841.0, 65340.0, 52272.0]"
26,0,location.county.name,object,55,"[Montgomery, Pulaski, Saline, Maricopa, Sacram...","[Montgomery, Montgomery, Montgomery, Montgomer...","[Kanawha, Kanawha, Kanawha, Kanawha, Kanawha]"

##### - 386 Nulls : `'tags'` -- *Gets its own section further down*

##### Dealing with Duplicates

> Dropping duplicates now. Needed the rest of the data to fill in NaNs.

In [540]:
# Check the duplicates
duplicates = data[data.duplicated()]

duplicates.shape # That's a lot of duplicates...

(5013, 29)

In [541]:
# Dropping duplicates
data.drop_duplicates(inplace=True)

data.shape

(1412, 29)

##### Final touch-ups and saving the data.

In [550]:
# Re-run the cols_overview function
columns_overview = cols_overview(data)

columns_overview.head(5)

,nulls_count,col_name,col_dtype,nunique,unique,col_data_1,col_data_2
0,41,tags,object,1339,"[['central_air', 'central_heat', 'community_ou...","[['central_air', 'central_heat', 'community_ou...","[['basement', 'garage_1_or_more', 'garage_2_or..."
14,1,description.beds,float64,13,"[3.0, 4.0, 2.0, 5.0, 1.0, 6.0, 12.0, 7.0, 8.0,...","[3.0, 4.0, 3.0, 3.0, 3.0]","[5.0, 3.0, 3.0, 3.0, 3.0]"
2,0,list_date,"datetime64[ns, UTC]",1289,"[2023-12-19 18:08:22+00:00, 2023-11-10 14:20:3...","[2023-12-19 18:08:22+00:00, 2023-11-10 14:20:3...","[2023-09-04 08:07:04.900000+00:00, 2023-09-04 ..."
16,0,flags.is_price_reduced,bool,2,"[False, True]","[False, False, False, False, False]","[False, False, False, False, False]"
27,0,has_photos,int32,2,"[0, 1]","[0, 1, 0, 1, 1]","[1, 1, 1, 1, 1]"

In [542]:
# Dropping listing_id because it's just an identifier and there's nulls. I'll just generate our own identifier.
data.drop(columns='listing_id', inplace=True)
data['listing_id'] = data.apply(lambda row: generate_id(), axis=1)

In [549]:
# Save the cleaned data
# --- !!! Uncomment only when saving. Run once and put the # back. !!! --- #
data.to_csv(os.path.join(output_path, 'semi-cleaned_housing_dataset.csv'), index=False)

### Dealing with Tags

Consider the fact that with tags, there are a lot of categorical variables.
- How many columns would we have if we OHE tags, city and state?
- Perhaps we can get rid of tags that have a low frequency.

In [544]:
# OHE categorical variables/ tags here
# tags will have to be done manually

### Dealing with Cities

- Sales will vary drastically between cities and states.  Is there a way to keep information about which city it is without OHE?
- Could we label encode or ordinal encode?  Yes, but this may have undesirable effects, giving nominal data ordinal values.
- What we can do is use our training data to encode the mean sale price by city as a feature (a.k.a. Target Encoding)
    - We can do this as long as we ONLY use the training data - we're using the available data to give us a 'starting guess' of the price for each city, without needing to encode city explicitly
- If you replace cities or states with numerical values (like the mean price), make sure that the data is split so that we don't leak data into the training selection. This is a great time to train test split. Compute on the training data, and join these values to the test data
- Note that you *may* have cities in the test set that are not in the training set. You don't want these to be NA, so maybe you can fill them with the overall mean

In [545]:
# perform train test split here
# do something with state and city

## Extra Data - STRETCH

> This doesn't need to be part of your Minimum Viable Product (MVP). We recommend you write a functional, basic pipeline first, then circle back and join new data if you have time

> If you do this, try to write your downstream steps in a way it will still work on a dataframe with different features!

- You're not limited to just using the data provided to you. Think/ do some research about other features that might be useful to predict housing prices. 
- Can you import and join this data? Make sure you do any necessary preprocessing and make sure it is joined correctly.
- Example suggestion: could mortgage interest rates in the year of the listing affect the price?

In [546]:
# import, join and preprocess new data here

## EDA/ Visualization

Remember all of the EDA that you've been learning about?  Now is a perfect time for it!
- Look at distributions of numerical variables to see the shape of the data and detect outliers.    
    - Consider transforming very skewed variables
- Scatterplots of a numerical variable and the target go a long way to show correlations.
- A heatmap will help detect highly correlated features, and we don't want these.
    - You may have too many features to do this, in which case you can simply compute the most correlated feature-pairs and list them
- Is there any overlap in any of the features? (redundant information, like number of this or that room...)

In [547]:
# perform EDA here

## Scaling and Finishing Up

Now is a great time to scale the data and save it once it's preprocessed.
- You can save it in your data folder, but you may want to make a new `processed/` subfolder to keep it organized

In [548]:
processed_path = '../processed'